Revit 2027 API
IFCData.CreateBoolean Method
 Creates a boolean data object.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IFCData CreateBoolean(
	bool value
)
Public Shared Function CreateBoolean (
	value As Boolean
) As IFCData
public:
static IFCData^ CreateBoolean(
	bool value
)
static member CreateBoolean :
        value : bool -> IFCData
Parameters
value Boolean
 The boolean value.
Return Value
IFCData
 The IFCData object.
See Also
Reference
IFCData Class
Autodesk.Revit.DB.IFC Namespace